---
kind: method
id: M:Autodesk.Revit.DB.RenderingSettings.SetBackgroundSettings(Autodesk.Revit.DB.BackgroundSettings)
source: html/f13da327-a88d-32ce-e769-c44f61375869.htm
---
# Autodesk.Revit.DB.RenderingSettings.SetBackgroundSettings Method

Changes the rendering background settings details for the current background style.

## Syntax (C#)
```csharp
public void SetBackgroundSettings(
	BackgroundSettings background
)
```

## Parameters
- **background** (`Autodesk.Revit.DB.BackgroundSettings`) - An instance of the new rendering background settings.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null